In [3]:
data = {'TraitScores':['TY1(0)TY2(0)TY6710_C4(0)(0)(0)TY6710_C10(0)(0)M|1(0)VE-1(2)TM2A(2)I2(2)', 'TY1(2)TY2(2)TY6710.10(2),(0)','Ty1(2)Vel(2)Ty2(0)PM(0)1BPh3(0)ToMV(2)Ty6710.4(0)(0)(0)Ty6710.10(0)(2)EBR4(0)FUS(2)',
'TY1(0)TY2(0)TY3(0)TOMV2(0)M11(0)1.13PH3(0)12(2)M11(0)TY6710_C4 (0)(0)(0),6710_C10 (0)(0)M11 (0)VE-1 (0)TM2A (0)12 (2)']
       ,'Histgroup':[2332,215,215,2332]}

In [5]:
import pandas as pd
# Create DataFrame
df = pd.DataFrame(data)
df

                                         TraitScores  Histgroup
0  TY1(0)TY2(0)TY6710_C4(0)(0)(0)TY6710_C10(0)(0)...       2332
1                       TY1(2)TY2(2)TY6710.10(2),(0)        215
2  Ty1(2)Vel(2)Ty2(0)PM(0)1BPh3(0)ToMV(2)Ty6710.4...        215
3  TY1(0)TY2(0)TY3(0)TOMV2(0)M11(0)1.13PH3(0)12(2...       2332

In [6]:
# Now apply a regex to perform extraction
df['one']=df.TraitScores.str.findall('[A-Z]\w+[-.]?\w.\(?\w+[),(\d)]*')

In [8]:
df['one']

0    [TY1(0), TY2(0), TY6710_C4(0)(0)(0), TY6710_C1...
1                   [TY1(2), TY2(2), TY6710.10(2),(0)]
2    [Ty1(2), Vel(2), Ty2(0), BPh3(0), ToMV(2), Ty6...
3    [TY1(0), TY2(0), TY3(0), TOMV2(0), M11(0)1, PH...
Name: one, dtype: object

In [9]:
# Remove braces
import numpy as np
def func(txt):
    arr = np.array(txt) # convert into np array
    str(arr) # convert into string
    return str(arr).lstrip('[').rstrip(']')  # remove part

In [11]:
# apply that func into it
df['one']=df['one'].apply(func)
df

,TraitScores,Histgroup,one
0,TY1(0)TY2(0)TY6710_C4(0)(0)(0)TY6710_C10(0)(0)...,2332,'TY1(0)' 'TY2(0)' 'TY6710_C4(0)(0)(0)' 'TY6710...
1,"TY1(2)TY2(2)TY6710.10(2),(0)",215,"'TY1(2)' 'TY2(2)' 'TY6710.10(2),(0)'"
2,Ty1(2)Vel(2)Ty2(0)PM(0)1BPh3(0)ToMV(2)Ty6710.4...,215,'Ty1(2)' 'Vel(2)' 'Ty2(0)' 'BPh3(0)' 'ToMV(2)'...
3,TY1(0)TY2(0)TY3(0)TOMV2(0)M11(0)1.13PH3(0)12(2...,2332,'TY1(0)' 'TY2(0)' 'TY3(0)' 'TOMV2(0)' 'M11(0)1...

In [12]:
# see the counnt basis on hist group
group=df.groupby(['Histgroup','one'])
group = group.size()
group.reset_index(name='Count')

   Histgroup                                                one  Count
0        215               'TY1(2)' 'TY2(2)' 'TY6710.10(2),(0)'      1
1        215  'Ty1(2)' 'Vel(2)' 'Ty2(0)' 'BPh3(0)' 'ToMV(2)'...      1
2       2332  'TY1(0)' 'TY2(0)' 'TY3(0)' 'TOMV2(0)' 'M11(0)1...      1
3       2332  'TY1(0)' 'TY2(0)' 'TY6710_C4(0)(0)(0)' 'TY6710...      1